# 시리즈 만들기

In [1]:
import pandas as pd
import numpy as np

# 데이터프레임 만들기

In [4]:
scientists = pd.DataFrame(
    data = {
        'Occupation': ['Chemist', 'Statistician'],
        'Born' : ['1920-07-25', '1876-10-27'],
        'Die' : ['1958-04-13', '1937-05-02'],
        'Age' : [37,61],
    },
index = ['Rosaline Franklin', 'William Gosset'],
columns = ['Occupation', 'Born', 'Die', 'Age'] ,
)
scientists.head()

                     Occupation        Born         Die  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-13   37
William Gosset     Statistician  1876-10-27  1937-05-02   61

# 데이터프레임에서 시리즈 선택하기

In [7]:
first_row = scientists.loc['Rosaline Franklin']
print(type(first_row))

print(first_row)

<class 'pandas.core.series.Series'>
Occupation       Chemist
Born          1920-07-25
Die           1958-04-13
Age                   37
Name: Rosaline Franklin, dtype: object

# index, values, keys 사용하기

# 시리즈의 mean, min, max, std 메서드 사용하기

# 시리즈와 불린 추출 사용하기

In [11]:
scientists = pd.read_csv("../data/scientists.csv")
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
dtypes: int64(1), object(4)
memory usage: 400.0+ bytes

In [14]:
ages = scientists.Age
ages.mean()

59.125

In [16]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [20]:
scientists[scientists.Age > scientists.Age.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [23]:
b_values = [True, True, False,True, True, False,True,False]

In [25]:
scientists[b_values]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician
3        Marie Curie  1867-11-07  1934-07-04   66             Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

# 시리즈와 브로드캐스팅

# 데이터프레임과 불린 추출

# 데이터프레임과 브로드캐스팅

# 열의 자료형 바꾸기와 새로운 열 추가하기

In [36]:
born_date = pd.to_datetime(scientists["Born"],format='%Y-%m-%d')
died_date = pd.to_datetime(scientists["Died"])
print(born_date)
scientists["born_date"], scientists["died_date"] = born_date, died_date
print(scientists.info())
scientists.head(1)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
born_date     8 non-null datetime64[ns]
died_date     8 non-null datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 528.0+ bytes
None

,Name,Born,Died,Age,Occupation,born_date,died_date
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16

# 시리즈, 데이터프레임의 데이터 섞어보기

# 데이터프레임의 열 삭제하기

# 피클 형식으로 저장하기

# CSV 불러오기